{
  "etap2": [
    {
      "number": 1,
      "title": "Układ równań a²+b²+c²=23 i a+2b+4c=22",
      "content": "Wyznacz wszystkie trójki (a, b, c) liczb rzeczywistych spełniające układ równań:\na² + b² + c² = 23\na + 2b + 4c = 22",
      "has_solution": true
    },
    {
      "number": 2,
      "title": "Sześciokąt ABCDEF z kątami 120°",
      "content": "Miara każdego kąta sześciokąta ABCDEF jest równa 120°. Udowodnij, że symetralne odcinków AB, CD i EF przecinają się w jednym punkcie.",
      "has_solution": true
    },
    {
      "number": 3,
      "title": "6 punktów i 10 odcinków",
      "content": "W przestrzeni danych jest 6 punktów, z których żadne cztery nie leżą na jednej płaszczyźnie. Łącząc niektóre z tych punktów narysowano 10 odcinków. Wykaż, że w ten sposób uzyskano co najmniej jeden trójkąt.",
      "has_solution": true
    },
    {
      "number": 4,
      "title": "Iloczyn (a+b)(b+c)(c+d)(d+a) zakończony cyframi \"10\"",
      "content": "Czy istnieją takie dodatnie liczby całkowite a, b, c, d, że liczba (a+b)(b+c)(c+d)(d+a) jest w systemie dziesiętnym zakończona cyframi \"10\"? Odpowiedź uzasadnij.",
      "has_solution": true
    },
    {
      "number": 5,
      "title": "Ostrosłup ABCS z kątami 20°",
      "content": "Trójkąt ABC jest podstawą ostrosłupa ABCS, w którym\n∠ASB = ∠BSC = ∠CSA = 20°.\nWykaż, że obwód trójkąta ABC jest nie mniejszy od długości każdej z krawędzi AS, BS i CS.",
      "has_solution": true
    }
  ],
  "etap1": [
    {
      "number": 1,
      "title": "Równanie |||x−1|−2|−3|−4|=0",
      "content": "Rozwiąż równanie: |||x−1|−2|−3|−4| = 0.",
      "has_solution": false
    },
    {
      "number": 2,
      "title": "Czworokąt ABCD z symetrycznymi punktami",
      "content": "Dany jest czworokąt wypukły ABCD o polu 1. Punkt K jest symetryczny do punktu B względem punktu A, punkt L jest symetryczny do punktu C względem punktu B, punkt M jest symetryczny do punktu D względem punktu C, punkt N jest symetryczny do punktu A względem punktu D. Oblicz pole czworokąta KLMN.",
      "has_solution": false
    },
    {
      "number": 3,
      "title": "Nierówność a/(a+1)+b/((a+1)(b+1))+c/((a+1)(b+1)(c+1))<1",
      "content": "Liczby a, b, c są dodatnie. Wykaż, że a/(a+1) + b/((a+1)(b+1)) + c/((a+1)(b+1)(c+1)) < 1.",
      "has_solution": false
    },
    {
      "number": 4,
      "title": "Liczba ośmiocyfrowa podzielna przez 101",
      "content": "Dana jest liczba ośmiocyfrowa a. Liczba ośmiocyfrowa b powstaje z liczby a poprzez przestawienie cyfry jedności liczby a na początek. Wykaż, że jeśli liczba a jest podzielna przez 101, to liczba b jest także podzielna przez 101.",
      "has_solution": false
    },
    {
      "number": 5,
      "title": "Okrąg wpisany w czworokąt ABCD",
      "content": "Okrąg o promieniu 1 jest wpisany w czworokąt wypukły ABCD. Okrąg ten jest styczny do boków AB, BC, CD, DA odpowiednio w punktach K, L, M, N. Wiadomo, że ∠KLM = 4∠AKN oraz ∠KNM = 4∠BKL. Oblicz długość odcinka LN.",
      "has_solution": false
    },
    {
      "number": 6,
      "title": "Liczby 15-cyfrowe z zerami",
      "content": "Ile jest liczb 15-cyfrowych k o następującej własności: Każde trzy kolejne cyfry liczby k są różne oraz w każdej trójce kolejnych cyfr liczby k występuje 0? Odpowiedź uzasadnij.",
      "has_solution": false
    },
    {
      "number": 7,
      "title": "Ostrosłup czworokątny z przekrojem",
      "content": "Czy istnieje taki ostrosłup czworokątny oraz taka płaszczyzna przecinająca wszystkie jego krawędzie boczne, że pole uzyskanego przekroju jest większe od pola podstawy ostrosłupa? Odpowiedź uzasadnij.",
      "has_solution": false
    }
  ]
}