{
  "etap2": [
    {
      "number": 1,
      "title": "Pięciokąt wypukły ABCDE z równymi polami",
      "content": "Dany jest taki pięciokąt wypukły ABCDE, w którym pola trójkątów ABD, BCE, CDA, DEB i EAC są równe. Wykaż, że każda przekątna tego pięciokąta jest równoległa do pewnego jego boku.",
      "has_solution": true
    },
    {
      "number": 2,
      "title": "Podzielność a² przez a+b",
      "content": "Dane są dodatnie liczby całkowite a i b. Wykaż, że jeżeli liczba a² jest podzielna przez liczbę a+b, to także liczba b² jest podzielna przez liczbę a+b.",
      "has_solution": true
    },
    {
      "number": 3,
      "title": "Turniej tenisa stołowego n zawodników",
      "content": "W turnieju tenisa stołowego wzięło udział n zawodników (n ≥ 4). Każdy zawodnik rozegrał dokładnie jeden mecz z każdym innym zawodnikiem, żaden mecz nie zakończył się remisem. Po turnieju wszyscy zawodnicy usiedli przy okrągłym stole w taki sposób, że każdy zawodnik wygrał z osobą siedzącą obok niego z jego lewej strony. Wykaż, że istnieją tacy trzej zawodnicy A, B i C, że A wygrał z B, B wygrał z C oraz C wygrał z A.",
      "has_solution": true
    },
    {
      "number": 4,
      "title": "Nierówność x(1−y)² + y(1−x)² < (1−xy)²",
      "content": "Udowodnij, że dla każdych liczb x, y należących do przedziału (0, 1) spełniona jest nierówność\nx(1−y)² + y(1−x)² < (1−xy)².",
      "has_solution": true
    },
    {
      "number": 5,
      "title": "Czworościan foremny z 6 kulami",
      "content": "Dany jest czworościan foremny opisany na sferze o promieniu 1. Udowodnij, że w tym czworościanie można umieścić 6 kul o promieniu ½, w taki sposób, aby każde dwie kule miały co najwyżej jeden punkt wspólny.",
      "has_solution": true
    }
  ],
  "etap1": [
    {
      "number": 1,
      "title": "Równanie √(x²+1)+√(y²+1)=x+y",
      "content": "Czy istnieją takie liczby rzeczywiste x, y, dla których √(x²+1)+√(y²+1) = x+y? Odpowiedź uzasadnij.",
      "has_solution": true
    },
    {
      "number": 2,
      "title": "Trójkąt ABC z AC=BC i kąt BCD prosty",
      "content": "Dany jest trójkąt ABC, w którym AC = BC. Punkt D leży na boku AB, przy czym BD = 2AD, a kąt BCD jest prosty. Wyznacz miarę kąta BAC.",
      "has_solution": true
    },
    {
      "number": 3,
      "title": "Prostokąty o równych polach i obwodach",
      "content": "Dane są dwa prostokąty o równych polach i o równych obwodach. Wykaż, że długości przekątnych obu prostokątów także są równe.",
      "has_solution": true
    },
    {
      "number": 4,
      "title": "99 liczb z jedynkami, dwójkami i zerami",
      "content": "Każda spośród pewnych 99 liczb naturalnych ma w zapisie dziesiętnym 10 jedynek, 20 dwójek oraz pewną liczbę zer. Udowodnij, że liczb tych nie można rozdzielić na dwie grupy w taki sposób, aby iloczyn liczb z pierwszej grupy był równy iloczynowi liczb z drugiej grupy.",
      "has_solution": true
    },
    {
      "number": 5,
      "title": "Pięciokąt ABCDE z kątami prostymi",
      "content": "W pięciokącie wypukłym ABCDE kąty przy wierzchołkach B i D są proste. Wykaż, że obwód trójkąta ACE jest nie mniejszy od 2BD.",
      "has_solution": true
    },
    {
      "number": 6,
      "title": "Wymierna suma √a+√b+√(ab)",
      "content": "Dane są takie dodatnie liczby wymierne a i b, dla których liczba √a+√b+√(ab) jest wymierna. Wykaż, że liczby √a oraz √b także są wymierne.",
      "has_solution": true
    },
    {
      "number": 7,
      "title": "Sześcian z PQ ≥ √2",
      "content": "Niech ABCDA'B'C'D' będzie sześcianem. Punkty K, L, M, N są odpowiednio środkami krawędzi AD, BC, A'B', C'D'. Punkty P i Q leżą odpowiednio na odcinkach KM i LN. Krawędź sześcianu jest równa 2. Udowodnij, że PQ ≥ √2.",
      "has_solution": true
    }
  ]
}