{
  "etap2": [
    {
      "number": 1,
      "title": "Pary (a,b) z a < b < 2013 i a+b = 4020",
      "content": "Wyznacz wszystkie pary (a, b) liczb całkowitych spełniających warunki\na < b < 2013 oraz a+b = 4020.",
      "has_solution": true
    },
    {
      "number": 2,
      "title": "Trójkąt ostrokątny z całkowitymi bokami i wysokościami",
      "content": "Czy istnieje taki trójkąt ostrokątny, w którym długości wszystkich boków i wszystkich wysokości są liczbami całkowitymi? Odpowiedź uzasadnij.",
      "has_solution": true
    },
    {
      "number": 3,
      "title": "Nierówność a√b + b√a + 1 > 3ab",
      "content": "Wykaż, że jeśli liczby a i b są dodatnie i mniejsze od 1, to\na·√b + b·√a + 1 > 3ab.",
      "has_solution": true
    },
    {
      "number": 4,
      "title": "Kolorowanie punktów płaszczyzny",
      "content": "Każdy punkt płaszczyzny należy pomalować na pewien kolor w taki sposób, aby każda prosta była jednokolorowa lub dwukolorowa. Jaka jest największa możliwa liczba kolorów, których można użyć do pomalowania punktów tej płaszczyzny? Odpowiedź uzasadnij.",
      "has_solution": true
    },
    {
      "number": 5,
      "title": "Liczby pierwsze (p,q) z p² + pq + q² kwadratem",
      "content": "Wyznacz wszystkie pary liczb pierwszych (p, q), dla których liczba\np² + pq + q²\njest kwadratem liczby całkowitej.",
      "has_solution": true
    }
  ],
  "etap1": [
    {
      "number": 1,
      "title": "Pociąg z 1,5% wzrostem pasażerów",
      "content": "Do pociągu, który może pomieścić co najwyżej 404 pasażerów, wsiadła na początkowej stacji pewna liczba podróżnych. Na następnej stacji liczba pasażerów tego pociągu zwiększyła się o 1,5%. Ilu podróżnych wsiadło do pociągu na początkowej stacji? Odpowiedź uzasadnij.",
      "has_solution": true
    },
    {
      "number": 2,
      "title": "Kolejne liczby a−b, b−c, c−d, d−a",
      "content": "Czy istnieją takie liczby całkowite a, b, c, d, że liczby a−b, b−c, c−d, d−a, wypisane w podanym porządku, są kolejnymi liczbami całkowitymi? Odpowiedź uzasadnij.",
      "has_solution": true
    },
    {
      "number": 3,
      "title": "Prostokąt ABCD z trójkątem równobocznym AEF",
      "content": "Punkty E i F leżą odpowiednio na bokach BC i CD prostokąta ABCD, przy czym trójkąt AEF jest równoboczny. Punkt M jest środkiem odcinka AF. Wykaż, że trójkąt BCM jest równoboczny.",
      "has_solution": true
    },
    {
      "number": 4,
      "title": "Układ równań 2x²+y²=4 i 2xy−2x=−5",
      "content": "Rozwiąż układ równań: 2x²+y² = 4 oraz 2xy−2x = −5.",
      "has_solution": true
    },
    {
      "number": 5,
      "title": "Czworokąt wypukły ABCD z równymi polami",
      "content": "Dany jest czworokąt wypukły ABCD. Punkty K i L są środkami odpowiednio boków AB i CD. Wykaż, że jeżeli pola czworokątów BCLK i DAKL są równe, to czworokąt ABCD jest trapezem.",
      "has_solution": true
    },
    {
      "number": 6,
      "title": "Punkt P na sferze opisanej na sześcianie",
      "content": "Punkt P leży na sferze opisanej na sześcianie. Wykaż, że suma kwadratów odległości punktu P od wierzchołków sześcianu nie zależy od wyboru punktu P.",
      "has_solution": true
    },
    {
      "number": 7,
      "title": "Kwadrat 2013×2013 z prostokątami 1×3",
      "content": "Czy kwadrat o wymiarach 2013×2013 można podzielić na prostokąty o wymiarach 1×3 w taki sposób, aby liczba prostokątów ułożonych pionowo różniła się o 1 od liczby prostokątów ułożonych poziomo? Odpowiedź uzasadnij.",
      "has_solution": true
    }
  ]
}