{
  "etap2": [
    {
      "number": 1,
      "title": "Trójka (a,b,c) liczb nieparzystych",
      "content": "Czy istnieje taka trójka (a, b, c) dodatnich liczb nieparzystych, że\n√(a−c) + √(b−c) = √(a+b)?\nOdpowiedź uzasadnij.",
      "has_solution": true
    },
    {
      "number": 2,
      "title": "Trapez ABCD ze środkami M i N",
      "content": "W trapezie ABCD punkty M i N są środkami odpowiednio podstaw AB i CD. Punkt P należy do odcinka MN. Udowodnij, że trójkąty ADP i BCP mają równe pola.",
      "has_solution": true
    },
    {
      "number": 3,
      "title": "Tablica 9×9 z kolejnymi sumami",
      "content": "W każde pole tablicy o wymiarach 9×9 wpisano pewną dodatnią liczbę całkowitą. Następnie obliczono sumy liczb znajdujących się w każdym wierszu i w każdej kolumnie. Czy może się zdarzyć, że 18 obliczonych sum to kolejne liczby naturalne w pewnym porządku? Odpowiedź uzasadnij.",
      "has_solution": true
    },
    {
      "number": 4,
      "title": "Punkty pomalowane na trzy kolory",
      "content": "Na płaszczyźnie zaznaczono n punktów (n ≥ 3), z których żadne trzy nie leżą na jednej prostej. Każdy z tych punktów pomalowano na jeden z trzech kolorów, przy czym każdego koloru użyto przynajmniej raz. Udowodnij, że istnieje taki trójkąt o wierzchołkach w zaznaczonych punktach, którego każde dwa wierzchołki mają różne kolory i do wnętrza którego nie należy żaden zaznaczony punkt.",
      "has_solution": true
    },
    {
      "number": 5,
      "title": "Trójkąt ABC z ∠CAE = ∠BCD",
      "content": "W trójkącie ABC punkt D jest środkiem boku AB, a punkt E jest środkiem odcinka CD. Wykaż, że jeżeli ∠CAE = ∠BCD, to AC = CD.",
      "has_solution": true
    }
  ],
  "etap1": [
    {
      "number": 1,
      "title": "Rozmienienie 50 zł na 13 monet",
      "content": "Ania rozmieniła banknot o nominale 50 zł na 13 monet, z których każda miała wartość 1 zł, 2 zł lub 5 zł. Ile monet pięciozłotowych otrzymała Ania? Podaj wszystkie możliwości. Odpowiedź uzasadnij.",
      "has_solution": true
    },
    {
      "number": 2,
      "title": "Trójkąt równoboczny ABC i punkty D, E",
      "content": "Trójkąt równoboczny ABC jest wpisany w okrąg o. Punkt D leży na krótszym łuku BC okręgu o. Punkt E jest symetryczny do punktu B względem prostej CD. Wykaż, że punkty A, D, E leżą na jednej prostej.",
      "has_solution": true
    },
    {
      "number": 3,
      "title": "Minimum wyrażenia a+b³",
      "content": "Wyznacz najmniejszą możliwą wartość wyrażenia a+b³, gdzie a i b są dodatnimi liczbami o iloczynie równym 1.",
      "has_solution": true
    },
    {
      "number": 4,
      "title": "Przyjęcie z 3 i 4 znajomymi",
      "content": "Na przyjęcie przyszło n osób. Początkowo każdy miał dokładnie 3 znajomych wśród pozostałych osób obecnych na przyjęciu. W trakcie przyjęcia niektóre osoby poznały się, w wyniku czego pod koniec przyjęcia każdy miał wśród pozostałych obecnych dokładnie 4 znajomych. Wyznacz wszystkie liczby n, dla których opisana sytuacja jest możliwa.",
      "has_solution": true
    },
    {
      "number": 5,
      "title": "Most przez rzekę",
      "content": "Po dwóch stronach rzeki o równoległych brzegach znajdują się dwa domy A i B, przy czym prosta AB nie jest prostopadła do brzegów rzeki. W którym miejscu należy wybudować most, prostopadły do brzegów rzeki, aby drogi z obu domów do mostu, biegnące w linii prostej, były równej długości? Podaj odpowiednią konstrukcję cyrklem i linijką oraz uzasadnij jej poprawność.",
      "has_solution": true
    },
    {
      "number": 6,
      "title": "Kartka 25×25 z wyciętym kwadratem 5×5",
      "content": "Od kwadratowej kartki o boku 25 odcięto kwadrat o boku 5. Czy pozostałą część kartki można pociąć na 100 prostokątów, z których każdy ma wymiary 1×6 lub 2×3? Odpowiedź uzasadnij.",
      "has_solution": true
    },
    {
      "number": 7,
      "title": "Czworościan z ∠ACB=∠ADB=90°",
      "content": "Dany jest czworościan ABCD, w którym ∠ACB = ∠ADB = 90° oraz AC = CD = DB. Wykaż, że AB < 2·CD.",
      "has_solution": true
    }
  ]
}