{
  "etap2": [
    {
      "number": 1,
      "title": "Iloczyny a·(b+c) i b·(a+c) kolejne",
      "content": "Liczby całkowite a, b oraz c są takie, że iloczyny\na·(b+c) oraz b·(a+c)\nsą dwiema kolejnymi liczbami całkowitymi. Wykaż, że co najmniej jeden z tych iloczynów jest kwadratem liczby całkowitej.",
      "has_solution": true,
      "has_statistics": true
    },
    {
      "number": 2,
      "title": "Kwadrat 6×6 rozcięty na prostokąty",
      "content": "Kwadrat 6×6 rozcięto na osiem prostokątów, z których każdy ma cztery boki o całkowitych długościach. Wykaż, że pewne dwa z tych ośmiu prostokątów mają równe pola.",
      "has_solution": true,
      "has_statistics": true
    },
    {
      "number": 3,
      "title": "Trapez ABCD z punktem P na AC",
      "content": "Dany jest trapez ABCD o podstawach AB i CD. Punkt P leży na odcinku AC, przy czym\n∠BPC = ∠BAD = ∠ABC = ∠ACB.\nWykaż, że AP = CD.",
      "has_solution": true,
      "has_statistics": true
    },
    {
      "number": 4,
      "title": "Kwadrat ABCD podzielony na figury",
      "content": "Punkty K, L, M, N leżą odpowiednio na bokach AB, BC, CD, DA kwadratu ABCD. Odcinki KL, MN, LN dzielą ten kwadrat na cztery figury o równych polach. Udowodnij, że odcinki KL, MN, KM również dzielą ten kwadrat na cztery figury o równych polach.",
      "has_solution": true,
      "has_statistics": true
    },
    {
      "number": 5,
      "title": "800 liczb na tablicy",
      "content": "Na tablicy znajduje się osiemset dodatnich liczb całkowitych mniejszych od 21. Czterysta z tych liczb zapisano niebieską kredą, a czterysta — żółtą. Wykaż, że można zmazać pewne liczby z tablicy (co najmniej jedną, ale nie wszystkie) w taki sposób, aby suma pozostałych na tablicy niebieskich liczb była równa sumie pozostałych na tablicy żółtych liczb.\nUwaga. Liczby na tablicy mogą się powtarzać.",
      "has_solution": true,
      "has_statistics": true
    }
  ],
  "etap1": [
    {
      "number": 1,
      "title": "Liczba 11...199...9 pierwsza",
      "content": "Wyznacz wszystkie takie liczby naturalne n, że liczba 11...1 (n jedynek) 99...9 (n dziewiątek) jest pierwsza.",
      "has_solution": true
    },
    {
      "number": 2,
      "title": "Punkty X, Y na bokach trójkąta ABC",
      "content": "Punkty X oraz Y leżą odpowiednio na bokach AC oraz BC trójkąta ABC. Punkt M jest środkiem odcinka XY. Załóżmy, że AX = MX = MC = MY = BY. Wyznacz miarę kąta AMB.",
      "has_solution": true
    },
    {
      "number": 3,
      "title": "Układanie cyfr z patyczków",
      "content": "Tomek ma do dyspozycji n jednakowych patyczków, z których układa liczby wielocyfrowe. Tomek zauważył, że suma cyfr największej z możliwych do ułożenia przez niego liczb jest równa dokładnie n. Wyznacz wszystkie liczby n, dla których taka sytuacja jest możliwa.",
      "has_solution": true
    },
    {
      "number": 4,
      "title": "Różnica sześcianów dwóch liczb pierwszych",
      "content": "Wyznacz wszystkie liczby pierwsze, które można przedstawić jako różnicę sześcianów dwóch liczb pierwszych.",
      "has_solution": true
    },
    {
      "number": 5,
      "title": "Trzy okręgi o wspólnym środku",
      "content": "Dane są trzy okręgi o₁, o₂, o₃ o wspólnym środku O. Na tych okręgach leżą odpowiednio punkty A, B, C, przy czym czworokąt ABCO jest prostokątem. Wykaż, że pole koła ograniczonego okręgiem o₁ jest równe polu pierścienia kołowego ograniczonego okręgami o₂ i o₃.",
      "has_solution": true
    },
    {
      "number": 6,
      "title": "Warunek ab+b+1, bc+c+1, ca+a+1",
      "content": "Dane są liczby rzeczywiste a, b, c. Udowodnij, że jeżeli pewne dwie z liczb ab+b+1, bc+c+1, ca+a+1 są równe 0, to także trzecia z nich jest równa 0.",
      "has_solution": true
    },
    {
      "number": 7,
      "title": "Diagram z liczbami 11 do 29",
      "content": "Czy w pola diagramu przedstawionego na rysunku można wpisać liczby całkowite od 11 do 29, każdą dokładnie raz, w taki sposób aby sumy liczb na wszystkich piętnastu odcinkach oznaczonych strzałkami były równe? Odpowiedź uzasadnij.",
      "has_solution": true
    }
  ]
}