{
  "etap1": [
    {
      "number": 1,
      "title": "Monety dwuzłotówki i pięciozłotówki",
      "content": "Jaś ma monety o łącznej wartości równej dokładnie 100 złotych, przy czym każda z tych monet jest dwuzłotówką albo pięciozłotówką. Wykaż, że Jaś może spośród tych monet wybrać takie, których łączna wartość jest równa dokładnie 50 złotych.",
      "has_solution": true
    },
    {
      "number": 2,
      "title": "Liczba n 21 razy większa od sumy cyfr",
      "content": "Dodatnia liczba całkowita n jest 21 razy większa od sumy swoich cyfr. Udowodnij, że liczba n jest podzielna przez 9.",
      "has_solution": true
    },
    {
      "number": 3,
      "title": "Pięć osób i liczba znajomych",
      "content": "Każda z pięciu osób napisała na tablicy, ilu znajomych ma wśród czterech pozostałych osób (jeżeli osoba A zna osobę B, to osoba B zna osobę A). Cztery z napisanych liczb są równe 1. Wyznacz wszystkie możliwe wartości piątej liczby. Odpowiedź uzasadnij.",
      "has_solution": true
    },
    {
      "number": 4,
      "title": "Warunek (a+b²)(a³+b³)=a⁴+b⁵",
      "content": "Niezerowe liczby rzeczywiste a, b spełniają warunek (a+b²)(a³+b³)=a⁴+b⁵. Wykaż, że b<0.",
      "has_solution": true
    },
    {
      "number": 5,
      "title": "Trapez ABCD z punktem P",
      "content": "Dany jest trapez ABCD o podstawach AB i CD. Punkt P znajduje się wewnątrz trapezu ABCD, przy czym AB = BP, DC = CP oraz ∠BPC = 90°. Oblicz miarę kąta APD.",
      "has_solution": true
    },
    {
      "number": 6,
      "title": "Liczba n z 2n sześcianem i 3n kwadratem",
      "content": "Dana jest liczba całkowita n o tej własności, że liczba 2n jest sześcianem liczby całkowitej, a liczba 3n jest kwadratem liczby całkowitej. Udowodnij, że liczba n jest podzielna przez 108.",
      "has_solution": true
    },
    {
      "number": 7,
      "title": "Trójkąt o bokach a, b, c (miary kątów)",
      "content": "Miary kątów wewnętrznych trójkąta ostrokątnego są równe a°, b°, c°. Wykaż, że istnieje trójkąt o bokach długości a, b, c.",
      "has_solution": true
    }
  ]
}